      *This is a body mass index (BMI) calculator program. 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. "BMICALCULATOR".
       AUTHOR. "Luqman".
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WEIGHT_KG PIC 999.
       01 HEIGHT_CM PIC 999.
       01 BMI PIC 999V99.

       PROCEDURE DIVISION.


       
       STOP RUN.
       END PROGRAM BMICALCULATOR.